# Lab | Data Cleaning and Formatting

Objective: Apply Python programming to perform data cleaning and formatting, including identifying and handling with missing values, duplicates, outliers, errors, and using various formatting techniques such as changing data types, renaming columns, and handling string values, to prepare data for analysis.

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

In [15]:
# Data cleaning and formatting has been already done in the scope of lab-dw-pandas
# https://github.com/lilitrdavidyan/lab-dw-pandas/blob/main/lab-dw-pandas.ipynb
# Missing Data cleaning and formatting activities will be continued here

In [16]:
import pandas as pd

In [17]:
customer_data = pd.read_csv('customer_data_cleaned.csv')
customer_data.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,QZ44356,AZ,Female,Bachelor,6979.5359,0.000000,94.0,0,Personal Auto,Four-Door Car,1131.464935
1,AI49188,NV,Female,Bachelor,12887.4317,48767.000000,108.0,0,Personal Auto,Two-Door Car,566.472247
2,WW63253,CA,Male,Bachelor,7645.8618,41390.311966,106.0,0,Corporate Auto,SUV,529.881344
3,GA49547,WA,Male,High School or Below,5363.0765,36357.000000,68.0,0,Personal Auto,Four-Door Car,17.269323
4,OC83172,OR,Female,Bachelor,8256.2978,62902.000000,69.0,0,Personal Auto,Two-Door Car,159.383042

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. For example, the gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

In [ ]:
# Your code here

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

Save the cleaned dataset to a new CSV file.

In [25]:
null_columns = customer_data.columns[customer_data.isna().any()]
null_columns
# Null values were already handled in the previous lab

Index([], dtype='object')

## Exercise 5: Dealing with duplicates

Use the .duplicated() method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the drop_duplicates() function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using .duplicated().

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

In [27]:
duplicate_rows = customer_data.duplicated()
customer_data[duplicate_rows]

Empty DataFrame
Columns: [customer, state, gender, education, customer_lifetime_value, income, monthly_premium_auto, number_of_open_complaints, policy_type, vehicle_class, total_claim_amount]
Index: []

# Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting. 

Write these functions in a separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [29]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [40]:
import data_cleaning_functions as mylib

raw_data = mylib.load_csv_data('file1.txt')

raw_data.shape

(4008, 11)

In [41]:
raw_data.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [42]:
raw_data = mylib.clean_column_names(raw_data)
raw_data.columns

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [43]:
raw_data = mylib.rename_column_names(raw_data, {'st': 'state'})
raw_data.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [45]:
raw_data.shape

(4008, 11)

In [46]:
raw_data.tail()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
mylib.remove_empty_raws(raw_data)

In [48]:
raw_data.shape

(1071, 11)

In [49]:
raw_data.tail()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1066,TM65736,Oregon,M,Master,305955.03%,38644.0,78.0,1/1/00,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,Cali,F,High School or Below,2031499.76%,63209.0,102.0,1/2/00,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.47%,16061.0,88.0,1/0/00,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11%,79487.0,114.0,1/0/00,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02%,54230.0,112.0,1/0/00,Personal Auto,Two-Door Car,537.600000

In [50]:
mylib.check_null_values(raw_data)

['gender', 'customer_lifetime_value']

In [52]:
mylib.get_rows_with_null_values(raw_data)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
11,VQ65197,California,NaN,College,819719.71%,0.0,110.0,1/0/00,Personal Auto,SUV,528.000000
12,DP39365,California,NaN,Master,879879.70%,77026.0,110.0,1/2/00,Corporate Auto,Four-Door Car,472.029737
13,SJ95423,Arizona,NaN,High School or Below,881901.89%,99845.0,110.0,1/1/00,Corporate Auto,SUV,528.000000
14,IL66569,California,NaN,College,538443.17%,83689.0,70.0,1/2/00,Corporate Auto,Four-Door Car,307.139132
...,...,...,...,...,...,...,...,...,...,...,...
135,MS41162,AZ,NaN,High School or Below,402296.35%,0.0,117.0,1/0/00,Personal Auto,SUV,975.107098
136,PU25891,Oregon,NaN,High School or Below,961831.09%,80536.0,119.0,1/0/00,Special Auto,Sports Car,53.798708
138,SX26335,Oregon,NaN,College,955292.69%,97732.0,79.0,1/0/00,Personal Auto,Four-Door Car,289.912200
449,LN31673,Washington,NaN,College,1131808.98%,38923.0,99.0,1/2/00,Personal Auto,Four-Door Car,115.728852
988,GT62080,Washington,M,High School or Below,NaN,55561.0,63.0,1/0/00,Personal Auto,Four-Door Car,227.872071

In [54]:
mylib.fill_null_with_previous_or_next_value(raw_data, 'gender', 'previous')
mylib.get_rows_with_null_values(raw_data)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
78,SP81997,Washington,F,Master,NaN,41275.0,96.0,1/0/00,Personal Auto,Four-Door Car,41.122303
988,GT62080,Washington,M,High School or Below,NaN,55561.0,63.0,1/0/00,Personal Auto,Four-Door Car,227.872071

In [55]:
mylib.fill_all_null_values(raw_data)
mylib.get_rows_with_null_values(raw_data)

Empty DataFrame
Columns: [customer, state, gender, education, customer_lifetime_value, income, monthly_premium_auto, number_of_open_complaints, policy_type, vehicle_class, total_claim_amount]
Index: []

In [56]:
raw_data['state'].value_counts()

Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: state, dtype: int64

In [57]:
# Mapping dictionary to fix state values
state_mapping = {
    'Oregon': 'OR',
    'California': 'CA',
    'Arizona': 'AZ',
    'Cali': 'CA',
    'Nevada': 'NV',
    'Washington': 'WA',
    'WA': 'WA',
    'AZ': 'AZ'
}
mylib.replace_inconsistent_values(raw_data, 'state', state_mapping)
raw_data['state'].value_counts()

CA    331
OR    320
AZ    211
WA    111
NV     98
Name: state, dtype: int64

In [58]:
# Find unique gender value counts
raw_data['gender'].value_counts(dropna=False)

F         543
M         444
Male       39
female     28
Femal      17
Name: gender, dtype: int64

In [59]:
# Mapping dictionary to fix gender values
gender_mapping = {
    'F': 'Female',
    'M': 'Male',
    'Male': 'Male',
    'female': 'Female',
    'Femal': 'Female'
}

# Replace inconsistent gender values with their correct counterparts
mylib.replace_inconsistent_values(raw_data, 'gender', gender_mapping)

raw_data['gender'].value_counts(dropna=False)

Female    588
Male      483
Name: gender, dtype: int64

In [60]:
# Find unique education value counts
raw_data['education'].value_counts(dropna=False)

Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: education, dtype: int64

In [61]:
# Replace "Bachelors" with "Bachelor" in the "education" column
mylib.replace_inconsistent_values(raw_data, 'education', {'Bachelors': 'Bachelor'})

# Verify the unique education values after fixing
raw_data['education'].value_counts(dropna=False)

Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: education, dtype: int64

In [62]:
raw_data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [63]:
mylib.fix_numeric_column_types(raw_data)
raw_data.dtypes

#This did not work :) Will have to find another solution. 
#Implemented new functions but due to time limitations will fix the columns locally for now.

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [64]:
# Convert "Customer Lifetime Value" to numeric values
raw_data['customer_lifetime_value'] = raw_data['customer_lifetime_value'].str.rstrip('%').astype(float) / 100
raw_data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [65]:
raw_data['number_of_open_complaints'].value_counts(dropna=False)

1/0/00    830
1/1/00    138
1/2/00     50
1/3/00     34
1/4/00     13
1/5/00      6
Name: number_of_open_complaints, dtype: int64

In [66]:
def clean_number_of_open_complaints(number_of_open_complaints):
    return int(number_of_open_complaints.split('/')[1])

# Replace the values in the 'number_of_open_complaints' column with their middle values
raw_data['number_of_open_complaints'] = raw_data['number_of_open_complaints'].apply(clean_number_of_open_complaints)

In [67]:
raw_data.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,WA,Female,Master,2514.5920,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,AZ,Female,Bachelor,6979.5359,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,NV,Female,Bachelor,12887.4317,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,CA,Male,Bachelor,7645.8618,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,WA,Male,High School or Below,5363.0765,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

In [69]:
customer_data = raw_data
mylib.save_data(raw_data, 'customer_data_cleaned_with_functions.csv')

Data saved to customer_data_cleaned_with_functions.csv successfully.

# Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we tried to do work with that column, we wouldn't have been able to do it because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, lets get some more interesting insights!

Instructions:

- Review again the statistics for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the .describe() method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [70]:
# Load the cleaned and formatted data into a DataFrame
data = pd.read_csv('customer_data_cleaned_with_functions.csv')

# Calculate the 75th percentile of the total claim amount
claim_amount_75th_percentile = data['total_claim_amount'].quantile(0.75)

# Calculate the bottom 25th percentile of the customer lifetime value
customer_lifetime_value_25th_percentile = data['customer_lifetime_value'].quantile(0.25)

# Create a new DataFrame with high policy claim amount and low customer lifetime value
high_claim_low_clv_df = data[
    (data['total_claim_amount'] > claim_amount_75th_percentile) &
    (data['customer_lifetime_value'] < customer_lifetime_value_25th_percentile)
]

# Use the describe() method to calculate summary statistics for both columns
summary_stats = high_claim_low_clv_df[['total_claim_amount', 'customer_lifetime_value']].describe()

print(summary_stats)

       total_claim_amount  customer_lifetime_value
count           38.000000                38.000000
mean           719.266560              3383.799634
std            146.929965               566.138380
min            537.600000              2287.596900
25%            632.936536              2946.558050
50%            685.284189              3637.993300
75%            797.400000              3858.484125
max           1185.988301              4016.542000